/*
Написати 2 тести що будуть виконувати такі вимоги

Створити команду login, що буде знаходити поле пошти та паролю та вводити туди дані та натискати на кнопку Log In

Тест №1

Тест буде відкривати сторінку https://www.edu.goit.global/account/login
Використати свою команду login
I. Команда буде знаходити поле для вводу пошти і вводити пошту user888@gmail.com
II. Буде вводити пароль 1234567890
III. Буде натискати кнопку Log in
IV. Буде знаходити в правому верхньому кутку кнопку
V. Відкриває меню сайту
VI. В меню знаходить кнопку Log out
VII. Натискає на неї та повертає на сторінку логіна

Тест №2

Тест буде відкривати сторінку https://www.edu.goit.global/account/login
Використати свою команду login
I. Команда буде знаходити поле для вводу пошти і вводити пошту testowyqa@qa.team
II. Буде вводити пароль QA!automation-1
III. Буде натискати кнопку Log in
IV. Буде знаходити в правому верхньому кутку кнопку
V. Відкриває меню сайту
VI. В меню знаходить кнопку Log out
VII. Натискає на неї та повертає на сторінку логіна
*/

// describe("Login tests", () => {
//   it("Test 1", () => {
//     cy.visit("https://www.edu.goit.global/account/login");

//     cy.login("user888@gmail.com", "1234567890");
//   });

//   it("Test 2", () => {
//     cy.visit("https://www.edu.goit.global/account/login");

//     cy.login("testowyqa@qa.team", "QA!automation-1");
//   });
// });
